In [ ]:
import pandas as pd
import matplotlib.pyplot as plt

In [ ]:
train_data = pd.read_csv('train.csv')
train_data

                id  user_id  joke_id  Rating
0        31030_110    31030      110   2.750
1        16144_109    16144      109   5.094
2          23098_6    23098        6  -6.438
3         14273_86    14273       86   4.406
4        18419_134    18419      134   9.375
...            ...      ...      ...     ...
1092054   9517_132     9517      132   3.156
1092055  27767_118    27767      118  -1.594
1092056   10580_81    10580       81   2.000
1092057  31007_119    31007      119   8.906
1092058    8420_98     8420       98  -3.344

[1092059 rows x 4 columns]

In [ ]:
train_data.corr()

          user_id   joke_id    Rating
user_id  1.000000  0.006201  0.019657
joke_id  0.006201  1.000000  0.160248
Rating   0.019657  0.160248  1.000000

In [ ]:
col = [col for col in train_data.columns if train_data[col].isnull().any()]
col

[]

In [ ]:
x = train_data.iloc[:,1:3]
x

         user_id  joke_id
0          31030      110
1          16144      109
2          23098        6
3          14273       86
4          18419      134
...          ...      ...
1092054     9517      132
1092055    27767      118
1092056    10580       81
1092057    31007      119
1092058     8420       98

[1092059 rows x 2 columns]

In [ ]:
y = train_data.iloc[:,3]
y.dtypes

dtype('float64')

In [ ]:
from sklearn.ensemble import RandomForestRegressor
RF = RandomForestRegressor()
RF.fit(x,y)

RandomForestRegressor(bootstrap=True, ccp_alpha=0.0, criterion='mse',
                      max_depth=None, max_features='auto', max_leaf_nodes=None,
                      max_samples=None, min_impurity_decrease=0.0,
                      min_impurity_split=None, min_samples_leaf=1,
                      min_samples_split=2, min_weight_fraction_leaf=0.0,
                      n_estimators=100, n_jobs=None, oob_score=False,
                      random_state=None, verbose=0, warm_start=False)

In [ ]:
test_data = pd.read_csv('test.csv')
test_data

               id  user_id  joke_id
0         6194_11     6194       11
1         19356_3    19356        3
2        23426_79    23426       79
3         40030_3    40030        3
4       19806_115    19806      115
...           ...      ...      ...
537875   14333_74    14333       74
537876   25245_16    25245       16
537877     4082_9     4082        9
537878  19638_128    19638      128
537879   40665_26    40665       26

[537880 rows x 3 columns]

In [ ]:
x_test = test_data.iloc[:,1:3]
x_test

        user_id  joke_id
0          6194       11
1         19356        3
2         23426       79
3         40030        3
4         19806      115
...         ...      ...
537875    14333       74
537876    25245       16
537877     4082        9
537878    19638      128
537879    40665       26

[537880 rows x 2 columns]

In [ ]:
a = RF.predict(x_test)

In [ ]:
pred = pd.Series(a)
pred.dtypes

dtype('float64')

In [ ]:
test_data['id'] = test_data['id'].to_csv('sub.csv',index = False)

In [ ]:
a = pd.read_csv('sub.csv')

In [ ]:
a['ratings'] = pred

In [ ]:
a = a.to_csv('finalsub.csv')

In [ ]:
pd.read_csv('finalsub.csv')

        Unnamed: 0         id  ratings
0                0    6194_11  6.29649
1                1    19356_3  2.54958
2                2   23426_79 -0.56745
3                3    40030_3 -0.71308
4                4  19806_115  4.21844
...            ...        ...      ...
537875      537875   14333_74 -0.32651
537876      537876   25245_16  6.05046
537877      537877     4082_9 -1.74495
537878      537878  19638_128  0.01672
537879      537879   40665_26  2.97603

[537880 rows x 3 columns]